unklstewy/espTari/test_apps/esptari_loader_integration/sdkconfig.defaults
# espTari Loader Integration Test Configuration

# Target: ESP32-P4
CONFIG_IDF_TARGET="esp32p4"

# Use custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_20M=y

# Enable XIP from PSRAM - allows code execution from PSRAM
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Disable PMP IDRAM split to allow code execution from dynamically allocated memory
# Required for dynamic code loading (esptari loader)
CONFIG_ESP_SYSTEM_PMP_IDRAM_SPLIT=n

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# SPIFFS configuration  
CONFIG_SPIFFS_MAX_PARTITIONS=3

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
